{
    "67f200000000000000000001 name": "Scrap Run",
    "67f200000000000000000001 description": "High-end gear doesn’t just appear out of thin air. Someone has to dig through the junk to make it work. I need electronics — not pretty, not new, just usable. Wires. RAM. The kind of stuff people overlook while chasing rifles and armor. Scavenge the leftovers, pull what you can from abandoned tech, and bring it to me. Quiet work. No questions. Don’t come back empty-handed.",
    "67f200000000000000000001 startedMessageText": "Five wires. Five RAM. Found in raid. That’s the job, Get it done.",
    "67f200000000000000000001 successMessageText": "Everything checks out. Payment’s already handled.",
    "67f200000000000000000001 failMessageText": "",
    "67f200000000000000000001 acceptPlayerMessage": "Don’t waste my time.",
    "67f200000000000000000001 declinePlayerMessage": "Then get out.",
    "67f200000000000000000001 completePlayerMessage": "Deal’s done.",
    "67f200000000000000000001 changeQuestMessageText": "",
    "67f200000000000000000001 note": "",
    "67f200000000000000000010": "Hand over 5 Wires",
    "67f200000000000000000011": "Hand over 5 RAM",
    
"67f200000000000000000101 name": "Scrap Run: Part 2",
    "67f200000000000000000101 description": "You handled the small stuff. Now I need components that actually matter. Processing units, power buffers — the backbone of anything worth running. CPUs and capacitors don’t survive firefights, which means they’re usually left behind. Dig through offices, labs, old server rooms. Bring me what still works. Same rules. No excuses.",
    "67f200000000000000000101 startedMessageText": "Ten CPUs. Ten capacitors. Found in raid. Get moving.",
    "67f200000000000000000101 successMessageText": "Good. This will keep things running.",
    "67f200000000000000000101 failMessageText": "",
    "67f200000000000000000101 acceptPlayerMessage": "You know what I want.",
    "67f200000000000000000101 declinePlayerMessage": "Then don’t come back.",
    "67f200000000000000000101 completePlayerMessage": "Transaction complete.",
    "67f200000000000000000101 changeQuestMessageText": "",
    "67f200000000000000000101 note": "",
    "67f200000000000000000110": "Hand over 10 CPUs",
    "67f200000000000000000111": "Hand over 10 Capacitors",
    
"67f200000000000000000201 name": "Clean Work",
    "67f200000000000000000201 description": "Scrap is easy. Anyone can dig through junk. This is different. I need to know you can handle problems directly and deliver results. Scavs have been getting bold. Thin them out quietly. When it’s done, bring me a Glock. Consider it proof — and a preview of what I’m willing to put in your hands.",
    "67f200000000000000000201 startedMessageText": "Ten scavs. Any place. Keep it clean. Bring me the Glock.",
    "67f200000000000000000201 successMessageText": "Good. Fewer scavs, and the Glock tells me you know quality. I’ll open up something special for you.",
    "67f200000000000000000201 failMessageText": "",
    "67f200000000000000000201 acceptPlayerMessage": "You want in? Do the job. Show me the pistol.",
    "67f200000000000000000201 declinePlayerMessage": "Then walk away.",
    "67f200000000000000000201 completePlayerMessage": "Clean work. You’ve earned access.",
    "67f200000000000000000201 changeQuestMessageText": "",
    "67f200000000000000000201 note": "Eliminate scavs and hand over a found-in-raid Glock 17 to unlock a special weapon setup.",
    "67f200000000000000000204": "Eliminate 10 Scavs",
    "67f200000000000000000305": "Hand over 1× found-in-raid Glock 17 9x19 pistol",
    
"67f200000000000000000401 name": "Do It My Way",
    "67f200000000000000000401 description": "Scrap runs and scav work are beneath you. I need proof you can handle real opposition. Take down enemy PMCs using the Glock build I specified. Make it back alive, and we’ll talk about what comes next. Fail… and replacements won’t be free.",
    "67f200000000000000000401 startedMessageText": "Five PMCs. Glock only. Built exactly how I want it.",
    "67f200000000000000000404": "Eliminate 5 enemy PMCs using a Glock 17 with the required modifications.",
    "67f200000000000000000401 successMessageText": "That’s how it’s done. Precision. Discipline.",
    "67f200000000000000000401 failMessageText": "You had the tool and still failed.",
    "67f200000000000000000401 acceptPlayerMessage": "Follow my rules, or don’t take the job.",
    "67f200000000000000000401 declinePlayerMessage": "Walk away then.",
    "67f200000000000000000401 completePlayerMessage": "Job’s finished.",
    "67f200000000000000000401 changeQuestMessageText": "Conditions updated.",
    "67f200000000000000000401 note": "PMC kills only. Glock 17 with required mods.",
    "67f200000000000000000445": "Hand over 1× found-in-raid Magnum Research Desert Eagle L6 .50 AE pistol.",
    
"67f300000000000000000100 name": "Code Word: Part 1",
    "67f300000000000000000100 description": "I need a note. Small. Easy to miss. It was never meant to last—just passed between trusted hands and burned once its job was done. Word is it still circulates on Customs. The kind of thing you’d find on people who work close to the boss there, or abandoned near the factory where deals used to happen quietly. Find it in raid, keep it safe, and bring it to me. Lose it, and you’ll have to start over.",
    "67f300000000000000000100 startedMessageText": "The note exists. Find it, extract, and don’t let anyone take it from you.",
    "67f300000000000000000100 successMessageText": "Good. That note opens doors you don’t see yet.",
    "67f300000000000000000100 failMessageText": "You failed. If the note still exists, it’s not in your hands anymore.",
    "67f300000000000000000100 acceptPlayerMessage": "Listen carefully. The code word is Voron. Bring me the note.",
    "67f300000000000000000100 declinePlayerMessage": "Then forget you ever heard the name.",
    "67f300000000000000000100 completePlayerMessage": "Transaction complete. We’ll speak again.",
    "67f300000000000000000100 changeQuestMessageText": "The conditions haven’t changed. Find the note and hand it over.",
    "67f300000000000000000101": "Find the note with the code word Voron in raid",
    "67f300000000000000000102": "Hand over the note with the code word Voron",
    
"67f200000000000000000501 name": "Do It My Way: Part 2",
    "67f200000000000000000501 description": "You followed instructions once. That doesn’t mean it wasn’t luck. I want to see consistency. Use the Desert Eagle build exactly as specified and eliminate enemy PMCs. Bring the weapon back when you’re done. Deviate, and the kills won’t count.",
    "67f200000000000000000501 startedMessageText": "Same rules. Desert Eagle only. Built exactly how I want it.",
    "67f200000000000000000504": "Eliminate 5 enemy PMCs using the specified Desert Eagle build.",
    "67f200000000000000000501 successMessageText": "Clean. Controlled. That’s what I expect.",
    "67f200000000000000000501 failMessageText": "You broke the rules. That’s on you.",
    "67f200000000000000000501 acceptPlayerMessage": "Do it my way, or don’t do it at all.",
    "67f200000000000000000501 declinePlayerMessage": "Then step aside.",
    "67f200000000000000000501 completePlayerMessage": "Job’s finished. You earned access.",
    "67f200000000000000000501 changeQuestMessageText": "Conditions updated.",
    "67f200000000000000000501 note": "PMC kills only. Desert Eagle with required modifications.",
   "67f200000000000000000546": "Hand over 1× FN P90 5.7x28 submachine gun. Found in raid status is not required.",

"67f200000000000000000601 name": "Do It My Way: Part 3",
"67f200000000000000000601 description": "You’ve followed instructions so far. Now I want to see if you can handle pressure with real equipment. Eliminate enemy PMCs using the P90 build I specified, then bring me a Colt M4A1. No improvising.",
"67f200000000000000000601 startedMessageText": "Ten PMCs. P90 only. Built exactly how I want it.",
"67f200000000000000000604": "Eliminate 10 enemy PMCs using the specified P90 build.",
"67f200000000000000000646": "Hand over 1× Colt M4A1 5.56x45 assault rifle. Found in raid status is not required.",
"67f200000000000000000601 successMessageText": "That’s how it’s done. You followed orders and delivered.",
"67f200000000000000000601 failMessageText": "You had the instructions. That should have been enough.",
"67f200000000000000000601 acceptPlayerMessage": "Stick to the build and don’t get creative.",
"67f200000000000000000601 declinePlayerMessage": "Then you’re not ready for this.",
"67f200000000000000000601 completePlayerMessage": "Job finished. We’ll talk again.",
"67f200000000000000000601 changeQuestMessageText": "Conditions updated.",
"67f200000000000000000601 note": "PMC kills only. P90 with required modifications. Hand over a Colt M4A1.",

"67f200000000000000000701 name": "Do It My Way: Part 4",
  "67f200000000000000000701 description": "You proved you can follow instructions. Now prove you can execute with discipline. Take the fight to other PMCs using the specified build, then bring me a DS Arms SA-58 as proof you can supply what you use.",
  "67f200000000000000000701 startedMessageText": "Fifteen PMCs. Use the exact build. Then hand over an SA-58.",
  "67f200000000000000000701 successMessageText": "Good. You did it your way — but you did it my standard. We can work.",
  "67f200000000000000000701 failMessageText": "",
  "67f200000000000000000701 acceptPlayerMessage": "Don’t improvise. Follow the spec, get it done, and bring me the rifle.",
  "67f200000000000000000701 declinePlayerMessage": "Then you’re not ready.",
  "67f200000000000000000701 completePlayerMessage": "Targets down. Rifle delivered.",
  "67f200000000000000000701 changeQuestMessageText": "",
  "67f200000000000000000701 note": "Use the required weapon build for the kills. Hand over an SA-58 to finish.",

  "67f200000000000000000704": "Eliminate 15 PMCs using the specified M4A1 build",
  "67f200000000000000000710": "Hand over 1× DS Arms SA-58 7.62x51 assault rifle. Found in raid status is not required.",

 "65fa9d4c8b3e4a9d9c0a5001 name": "Do It My Way: Part 5",
  "65fa9d4c8b3e4a9d9c0a5001 description": "You’ve come too far to slow down now. The weapon I gave you isn’t for show — it’s a statement. Use it the way it was meant to be used. Clean hits, controlled pressure. Prove you can finish what you start.",
"65fa9d4c8b3e4a9d9c0a5002": "Eliminate 15 PMCs using the specified  DS Arms SA-58 7.62x51 assault rifle build",
  "65fa9d4c8b3e4a9d9c0a5001 startedMessageText": "Targets are out there. Use the rifle I gave you and make every shot count.",
  "65fa9d4c8b3e4a9d9c0a5001 acceptPlayerMessage": "This isn’t a test anymore. Do it my way — or don’t do it at all.",
  "65fa9d4c8b3e4a9d9c0a5001 declinePlayerMessage": "Then you’re not ready. Come back when you are.",
  "65fa9d4c8b3e4a9d9c0a5001 successMessageText": "Good. You handled it exactly how I expected.",
  "65fa9d4c8b3e4a9d9c0a5001 failMessageText": "You lost your edge. Try again when you’ve got control.",
  "65fa9d4c8b3e4a9d9c0a5001 completePlayerMessage": "Job’s done. The rifle served its purpose.",
  "65fa9d4c8b3e4a9d9c0a5001 changeQuestMessageText": "Plans changed. Stay sharp.",
  "65fa9d4c8b3e4a9d9c0a5005": "Handover  1× AS VAL 9x39 special assault rifle. Found in raid status is not required.",

  "7b3e9c4d1a5f8e2c0d9a6001 name": "Do It My Way: Part 6",
  "7b3e9c4d1a5f8e2c0d9a6001 description": "You’ve been following instructions so far. Now I need to know you can execute without improvising. Same weapon. Same setup. Same discipline. Take down PMCs using the AS VAL exactly as specified, then bring me the RSASS. This isn’t about firepower — it’s about control.",
  "7b3e9c4d1a5f8e2c0d9a6001 note": "Use the AS VAL with the required configuration. Any deviation won’t count. After the job, hand over the RSASS.",
  "7b3e9c4d1a5f8e2c0d9a6001 startedMessageText": "Stick to the plan. Use the AS VAL exactly as instructed and eliminate the targets. When you’re done, bring me the RSASS.",
  "7b3e9c4d1a5f8e2c0d9a6001 successMessageText": "Good. You followed instructions and delivered what I asked for. That kind of discipline gets noticed.",
  "7b3e9c4d1a5f8e2c0d9a6001 failMessageText": "You missed something. Wrong setup, wrong execution, or no delivery. Fix it.",
  "7b3e9c4d1a5f8e2c0d9a6001 acceptPlayerMessage": "If you’re going to do this, do it my way. No shortcuts.",
  "7b3e9c4d1a5f8e2c0d9a6001 declinePlayerMessage": "Then you’re not ready. Come back when you can follow instructions.",
  "7b3e9c4d1a5f8e2c0d9a6001 completePlayerMessage": "Job’s done. Weapon’s delivered. We’ll move forward.",
  "7b3e9c4d1a5f8e2c0d9a6001 changeQuestMessageText": "Conditions updated. Stay focused.",

 "9c4a1e7d5b0f3a2c8e6d7001": "Hand over 1× Remington R11 RSASS 7.62x51 marksman rifle. Found in raid status is not required.",
 "7b3e9c4d1a5f8e2c0d9a6002": "Eliminate 15 PMCs using the specified AS VAL 9x39 special assault rifle build.",


  "91f8c2000000000000007001 name": "Do It My Way: Part 7",

  "91f8c2000000000000007001 description": "You’ve been following instructions so far. Now I want proof you can execute without improvising. Take the RSASS I specified, exactly as built, and put down PMCs with it. No shortcuts, no substitutions. When you’re done, bring me a SCAR-H. I need one in working condition. This isn’t about payment — it’s about discipline.",
 "91f8c2000000000000007001 startedMessageText": "You know the rules. Use the RSASS exactly as I told you. Make the kills count. Then bring me the SCAR-H. Don’t come back half-finished.",
  "91f8c2000000000000007001 acceptPlayerMessage": "Good. Follow the instructions and this goes smoothly.",
  "91f8c2000000000000007001 declinePlayerMessage": "If you’re not willing to do it properly, don’t waste my time.",
  "91f8c2000000000000007001 successMessageText": "That’ll do. You followed orders, and the weapon checks out. Remember this — most people fail because they think they know better.",
  "91f8c2000000000000007001 completePlayerMessage": "Job’s done. RSASS kills confirmed, SCAR-H delivered.",
  "91f8c2000000000000007001 failMessageText": "You slipped up. Start over, and do it the right way this time.",
  "91f8c2000000000000007001 changeQuestMessageText": "Conditions updated. Stick to the requirements.",
  "91f8c2000000000000007001 note": "Use the specified RSASS configuration for PMC eliminations. Deliver one FN SCAR-H X-17 upon completion.",

"91f8c2000000000000007030": "Hand over 1× FN SCAR-H X-17 7.62x51 assault rifle. Found in raid status is not required.",

"91f8c2000000000000007010": "Eliminate 20 PMCs using the specified Remington R11 RSASS 7.62x51 marksman rifle build",


  "c8e4d9000000000000008001 name": "Do It My Way: Part 8",
  "c8e4d9000000000000008001 description": "You’ve been following instructions long enough. Now I want proof you can run high-end hardware the right way. Take out PMCs using the exact setup I specify — no shortcuts, no substitutions. When it’s done, bring me the rifle. I’ll know if you cut corners.",
  "c8e4d9000000000000008001 startedMessageText": "This one isn’t about the kill count — it’s about discipline. Use the weapon exactly as issued. Anything missing, anything swapped, and it doesn’t count.",
  "c8e4d9000000000000008001 successMessageText": "That’s how it’s done. Clean work, correct setup, no excuses. You’re starting to understand how I operate.",
  "c8e4d9000000000000008001 failMessageText": "You failed the job. Either the setup was wrong or you didn’t finish what you started. Come back when you’re ready to do it properly.",
  "c8e4d9000000000000008001 acceptPlayerMessage": "I’ll do it your way. No changes.",
  "c8e4d9000000000000008001 declinePlayerMessage": "I’m not taking this one yet.",
  "c8e4d9000000000000008001 completePlayerMessage": "The rifle’s accounted for. The kills speak for themselves.",
  "c8e4d9000000000000008001 changeQuestMessageText": "Requirements updated. Stick to the plan.",
  "c8e4d9000000000000008001 note": "Eliminate PMCs using the required weapon configuration and hand over the rifle when finished.",

"c8e4d9000000000000008030": "Hand over 1× SWORD International Mk-18 .338 LM marksman rifle. Found in raid status is not required.", 

 "c8e4d9000000000000008010": "Eliminate 20 PMCs using the specified FN SCAR-H X-17 7.62x51 assault rifle build.",


  "f4b9a1000000000000009001 name": "Do It My Way: Part 9",
  "f4b9a1000000000000009001 description": "You’ve come this far because you followed instructions and didn’t improvise. This is the final check. One rifle. One configuration. No substitutions. No excuses. Finish it exactly how it’s laid out.",
  "f4b9a1000000000000009001 startedMessageText": "This is the last one. You know the rules. Use the rifle as issued and prove you can execute without deviation.",
  "f4b9a1000000000000009001 successMessageText": "That’s it. You didn’t cut corners, you didn’t adapt, and you didn’t fail. You followed the blueprint and delivered exactly what was asked.",
  "f4b9a1000000000000009001 failMessageText": "You broke the rules or lost the opportunity. Come back when you’re ready to do it properly.",
  "f4b9a1000000000000009001 acceptPlayerMessage": "This is the final test. One kill, one build, no freedom to improvise.",
  "f4b9a1000000000000009001 declinePlayerMessage": "If you’re not ready to commit to the setup, don’t take the contract.",
  "f4b9a1000000000000009001 completePlayerMessage": "Contract fulfilled. You did it my way — start to finish.",
  "f4b9a1000000000000009001 changeQuestMessageText": "Requirements updated. Review the contract and proceed carefully.",
  "f4b9a1000000000000009001 note": "Use the specified MK18 configuration to eliminate a PMC. The weapon and attachments must match exactly.", 

"f4b9a1000000000000009010" :  "Eliminate 25 PMCs using the specified SWORD International Mk-18 .338 LM marksman rifle build."


}